In [5]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import sklearn as sk

**ADDING DATA**

In [37]:
data=pd.read_csv('data.csv')
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [27]:
x=data.iloc[:,:-1].values
y=data.iloc[:,-1].values
x,y

(array([[4.4e+01, 7.2e+04],
        [2.7e+01, 4.8e+04],
        [3.0e+01, 5.4e+04],
        [3.8e+01, 6.1e+04],
        [4.0e+01,     nan],
        [3.5e+01, 5.8e+04],
        [    nan, 5.2e+04],
        [4.8e+01, 7.9e+04],
        [5.0e+01, 8.3e+04],
        [3.7e+01, 6.7e+04]]),
 array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
       dtype=object))

**REPLACING NAN or MISSING DATA**

In [ ]:
# by interpolation
data.interpolate(method="cubic",inplace=False)

C:\Users\adity\AppData\Local\Temp\ipykernel_8456\326515452.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  data.interpolate(method="cubic",inplace=False)

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63787.255466       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  39.318449  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes